Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/personal_finance/debt/personal_insolvency/debt_settlement_arrangements.html.txt.tmx
Source language: en
Languages: ga

source: • Main elements of a DSA
ga: • Na príomhghnéithe de DSA

source: A Debt Settlement Arrangement (DSA) is one of 3 debt resolution mechanisms introduced by the Personal Insolvency Act 2012 for people who cannot afford to pay their personal debts
ga: Tá Socrú Réitigh Fiachais (DSA) ar cheann amháin de 3 mheicníocht réitigh fiachais a tugadh isteach leis an Acht um Dhócmhainneacht Phearsanta 2012 do dhaoine nach bhfuil sé ar a n-acmhainn a bhfiacha pearsanta a íoc

source: These mechanisms offer different solutions to people in different situations
ga: Tairgeann na meicníochtaí sin réitigh dhifriúla do dhaoine i gcásanna difriúla

source: The Debt Settlement Arrangement applies to the agreed settlement of unsecured debts, usually over a period of 5 years
ga: Baineann an Socrú Réitigh Fiachais le socrú comhaontaithe fiach neamhurraithe thar thréimhse 5 bliana de ghnáth

source: The limit of 5 years can increase to 6 years in some situations
ga: Is féidir an teorainn 5 bliana a mhéadú go 6 bliana i gcásanna áirithe

source: When the DSA concludes successfully, the debts that it covers will be fully discharged and the debtor will be solvent again
ga: Nuair a chuirtear an DSA i gcrích go sásúil, urscaoilfear na fiacha a chlúdaíonn sé agus beidh an féichiúnaí sócmhainneach an athuair

source: This document describes how to qualify for a DSA and how the DSA process works
ga: Déantar cur síos sa doiciméad seo ar conas cáiliú le haghaidh DSA agus conas a oibríonn an próiseas DSA

source: The Insolvency Service of Ireland (ISI) has published detailed information about DSAs, including possible scenarios, FAQs and a booklet
ga: D’fhoilsigh Seirbhís Dócmhainneachta na hÉireann (ISI) faisnéis mhionsonraithe faoi DSAnna, lena n-áirítear cásanna féideartha, ceisteanna coitianta agus leabhrán

source: It also provides extra information on DSAs, including a quick guide (pdf), on its website backontrack.ie, aimed at people who are struggling with debt
ga: Tugann an SDÉ eolas breise ar DSAanna agus treoir ghearr (pdf) ar an suíomh backontrack.ie, atá dírithe ar dhaoine a bhfuil fadhbanna fiachais acu

source: You can read a general overview of personal insolvency options here
ga: Is féidir forbhreathnú ginearálta ar an gcóras dócmhainneachta pearsanta a léamh anseo

source: Debt Settlement Arrangements provide for the agreed settlement of debts in the case of people who have unsecured debts and have no prospect of being able to pay off their debts in the next 5 years
ga: Déanann Socruithe Réitigh Fiachais foráil do shocrú comhaontaithe fiach i gcás daoine a bhfuil fiacha neamhurraithe acu agus nach bhfuil aon ionchas acu go mbeidh siad ábalta a bhfiacha a íoc sna 5 bliana romhainn

source: You may opt for a DSA if you have secured debts as well, but your secured debts will not be covered by the DSA
ga: Féadfaidh tú DSA a roghnú má tá fiacha urraithe agat freisin, ach ní chlúdóidh an DSA d’fhiacha urraithe

source: See ‘Secured and unsecured debts’ below for an explanation of these terms
ga: Féach ‘fiacha urraithe agus fiacha neamhurraithe’ thíos le haghaidh míniú ar na téarmaí sin a fháil

source: You can only avail of a DSA once in your lifetime
ga: Ní fhéadfaidh tú leas a bhaint as DSA ach uair amháin i do shaol

source: You cannot get a DSA if you are involved in one of the other debt resolution processes introduced by the Act, or in the bankruptcy process
ga: Ní fhéadfaidh tú DSA a fháil má tá baint agat le ceann amháin de na próisis eile um réiteach fiachais a tugadh isteach leis an Acht, nó má tá baint agat leis an bpróiseas féimheachta

source: Nor can you get a DSA if you have completed a Personal Insolvency Arrangement or a bankruptcy within the last 5 years, or a Debt Relief Notice within the last 3 years
ga: Ní fhéadfaidh tú DSA a fháil ach oiread más rud é gur chuir tú Socrú um Dhócmhainneacht Phearsanta nó féimheacht i gcrích le 5 bliana anuas nó gur chuir tú Fógra um Fhaoiseamh Fiachais i gcrích le 3 bliana anuas

source: You can only get a DSA by agreement of a specified majority of your unsecured creditors – see Main elements of a DSA below
ga: Ní fhéadfaidh tú DSA a fháil ach trí chomhaontú a fháil ó fhormhór do chreidiúnaithe neamhurraithe - féach na príomhghnéithe de DSA thíos

source: Before you make your application, you must either be domiciled in the State or, within the year, have been living in the State or had a place of business in the State
ga: Sula ndéanann tú d’iarratas, caithfidh go bhfuil sainchónaí ort sa Stát nó, laistigh den bhliain, go raibh tú i do chónaí sa Stát nó go raibh áit ghnó agat sa Stát

source: As mentioned above, the only debts that a DSA can cover are unsecured debts
ga: Mar a luaitear thuas, féadann an DSA fiacha neamhurraithe agus na fiacha sin amháin a chlúdach

source: There is no limit on the total amount of debt that can be covered
ga: Níl aon teorainn leis an méid iomlán fiachais is féidir a chlúdach

source: However, if your total debt is unsecured and is €35,000 or less (formerly €20,000) you can opt for a Debt Relief Notice instead of a DSA
ga: Mar sin féin, más rud é go bhfuil d’fhiachas iomlán neamhurraithe agus go bhfuil sé cothrom le €35,000 nó níos lú (€20,000 ar dtús) féadfaidh tú Fógra um Fhaoiseamh Fiachais a roghnú in ionad DSA

source: If you have some secured debts, you can apply for a Personal Insolvency Arrangement, which can cover both secured and unsecured debts
ga: Má tá roinnt fiacha urraithe agat, féadfaidh tú iarratas a dhéanamh ar Shocrú um Dhócmhainneacht Phearsanta, rud a fhéadann fiacha urraithe agus fiacha neamhurraithe araon a chlúdach

source: However, if you can manage to cover your secured debts, whether by making full repayments or by agreeing an arrangement with your secured creditors (such as interest-only repayments on your mortgage) you can apply for a Debt Settlement Arrangement to cover your unsecured debts separately
ga: Mar sin féin, más féidir leat d’fhiacha urraithe a chlúdach, trí aisíocaíochtaí iomlána a dhéanamh nó trí shocrú a chomhaontú le do chreidiúnaithe urraithe (ar nós aisíocaíochtaí úis amháin ar do mhorgáiste), féadfaidh tú iarratas a dhéanamh ar Shocrú um Dhócmhainneacht Fiachais le d’fhiacha neamhurraithe a chlúdach ar leithligh

source: At least three-quarters (75%) of your unsecured debts must have built up at least 6 months before you apply for a DSA – in other words, you can’t apply for a DSA if any more than 25% of your unsecured debts were incurred in the last 6 months
ga: Is gá gur ardaíodh trí cheathrú (75%) ar a laghad de d’fhiacha neamhurraithe 6 mhí ar a laghad sula ndéanann tú iarratas ar DSA - is é sin le rá, ní fhéadfaidh tú iarratas a dhéanamh ar DSA má tabhaíodh 25% de d’fhiacha neamhurraithe le 6 mhí anuas

source: Secured and unsecured debts
ga: Fiacha urraithe agus fiacha neamhurraithe

source: A Debt Settlement Arrangement only covers unsecured debts so it is important to know whether your debts are secured or not
ga: Ní chlúdaíonn Socrú Réitigh Fiachais ach fiacha neamhurraithe. Dá bhrí sin, tá sé tábhachtach gurb eol duit cé acu atá d’fhiacha urraithe nó nach bhfuil

source: A secured debt is a loan on which property or goods are available as security against non-payment
ga: Is é is fiach urraithe ann ná iasacht ar a bhfuil réadmhaoin nó earraí ar fáil mar urrús in aghaidh neamhíoca

source: Mortgages and car loans are the most common secured loans
ga: Is iad morgáistí agus iasachtaí cairr na hiasachtaí urraithe is coitianta

source: Some examples of unsecured debts are: utility bill arrears (gas, electricity etc.); credit card debt; bank overdrafts; credit union loans
ga: Ar roinnt samplaí d’fhiacha neamhurraithe tá: riaráiste bille fóntais (gás, leictreachas, etc.); fiach cárta creidmheasa; rótharraingtí bainc; iasachtaí comhar creidmheasa

source: However, if they are rolled up into your mortgage, they become secured loans
ga: Má chuirtear san áireamh i do mhorgáiste iad, áfach, éiríonn siad ina n-iasachtaí urraithe

source: The Personal Insolvency Act 2012 specifies certain types of debt that cannot be written off by the new debt settlement procedures, which include the Debt Settlement Arrangement
ga: San Acht um Dhócmhainneacht Phearsanta 2012, sonraítear cineálacha áirithe féich nach féidir leis na socruithe nua réitigh fiachais iad a dhíscríobh, lena n-áirítear an Socrú Réitigh Fiachais

source: These are called excluded debts
ga: Tugtar fiacha eisiata orthu sin

source: The types of debt that are excluded and cannot be covered by a DSA are:
ga: Is iad seo na cineálacha féich atá eisiata agus nach féidir le DSA iad a chlúdach:

source: • Debts under family law orders, such as maintenance orders for spouses and children
ga: • Fiacha faoi orduithe dlí teaghlaigh, ar nós orduithe cothabhála do chéilí agus do leanaí

source: • Debts due under court awards for personal injury or wrongful death
ga: • Fiacha atá dlite faoi dhámhachtainí cúirte as gortú pearsanta nó bás éagórach

source: • Debts arising from a loan (or forbearance of a loan) obtained through fraud or similar wrongdoing
ga: • Fiacha a thagann as iasacht (nó staonadh iasachta) a fuarthas trí chalaois nó trí éagóir chosúil

source: • Debts arising under fines imposed by the courts for criminal offences or court orders made under the Proceeds of Crime Acts
ga: • Fiacha a thagann as fíneálacha a ghearr na cúirteanna as cionta coiriúla nó orduithe cúirte a rinneadh faoi na hAchtanna um Fháltais ó Choireacht

source: The Act specifies certain other types of debt to be excludable from a DSA
ga: Sonraítear san Acht cineálacha áirithe eile féich a bheidh in-eisiata as DSA

source: This means that they can be covered by the DSA if the creditor is asked and agrees to let them be included – in which case they become permitted debts – debts that the creditor permits to be covered
ga: Ciallaíonn sé sin go bhféadfaidh an DSA iad a chlúdach más rud é go n-iarrtar ar an gcreidiúnaí a gcur san áireamh a cheadú agus go gcomhaontaíonn an creidiúnaí leis

source: If the creditor is asked and does not respond, the creditor will also have been deemed to have consented to the debts being included
ga: Sa chás sin, éiríonn siad ina bhfiacha ceadaithe, is iad sin, fiacha a cheadaíonn an creidiúnaí le bheith clúdaithe

source: Most types of excludable debts are those owed to the State
ga: Is iad na fiacha sin a dhlitear leis an Stát formhór na gcineálacha féich in-eisiata

source: The types of debt that are excludable and may be covered if the creditor agrees are:
ga: Is iad seo na cineálacha féich atá in-eisiata agus a bhféadfar iad a chlúdach má chomhaontaíonn an creidiúnaí:

source: • Taxes, duties, charges or levies owed to the State, such as income tax, the Household Charge, the Local Property Tax, VAT, capital taxes
ga: • Cánacha, dleachtanna, muirir nó tobhaigh atá dlite leis an Stát, amhail cáin ioncaim, an Muirear Teaghlaigh, an Cháin Réadmhaoine Áitiúil, CBL, cánacha caipitil

source: • Service charges owed to local authorities
ga: • Muirir sheirbhíse atá dlite le húdaráis áitiúla

source: • Money owed under the Nursing Homes Support Scheme (in respect of a loan advanced by the HSE to a nursing home resident to cover the amount due from the principal private residence)
ga: • Airgead atá dlite faoin Scéim um Thacaíocht Tithe Banaltrais (i leith iasachta a réamh-íoc FSS le cónaitheoir i dteach banaltrais chun an méid atá dlite as an bpríomhtheach príobháideach a chlúdach)

source: • Money owed to the Department of Social Protection, such as overpayments
ga: • Airgead atá dlite leis an Roinn Coimirce Sóisialaí, ar nós ró-íocaíochtaí

source: • Debts due to owners’ management companies in respect of annual service charges or contributions due for multi-unit developments (this is the only non-State debt in this category)
ga: • Fiacha atá dlite le cuideachtaí bainistíochta úinéirí i leith muirir bhliantúla sheirbhíse nó ranníocaíochtaí atá dlite as forbairtí ilaonaid (is é seo an t-aon fhiach neamh-Stáit sa chatagóir seo)

source: Main elements of a DSA
ga: Na príomhghnéithe de DSA

source: You must make your proposal for a Debt Settlement Arrangement through a Personal Insolvency Practitioner (PIP) – see The DSA process below
ga: Ní mór duit do thogra le haghaidh Socrú Réitigh Fiachais a dhéanamh trí Chleachtóir um Dhócmhainneacht Phearsanta (PIP) - féach an próiseas DSA thíos

source: The DSA proposal must be agreed by you and then approved at a creditors’ meeting
ga: Ní mór an togra le haghaidh DSA a bheith comhaontaithe agat agus faofa ag cruinniú na gcreidiúnaithe ina dhiaidh sin

source: The proposed DSA will have to get the support of creditors representing at least 65% of the total debt that it covers
ga: Ní mór an DSA molta tacaíocht a fháil ó chreidiúnaithe a dhéanann ionadaíocht do 65% ar a laghad den fhiachas iomlán a chlúdaíonn sé

source: A DSA may involve you making regular payments of agreed amounts to your Personal Insolvency Practitioner, who will distribute them to your creditors according to the terms of the DSA
ga: Is féidir go mbeidh sé i gceist le DSA go ndéanfaidh tú íocaíochtaí rialta de na méideanna comhaontaithe le do Chleachtóir um Dhócmhainneacht Phearsanta, a dháilfidh iad ar do chreidiúnaithe de réir théarmaí an DSA

source: Your creditors may not take any action against you to enforce the debt during the lifetime of the DSA
ga: Ní fhéadfaidh do chreidiúnaithe caingean a thionscnamh i d’aghaidh chun an fiach a fhorghníomhú le linn shaolré an DSA

source: If you keep to the terms of the DSA, the rest of your debt to the creditors that it covered will be discharged and you will be solvent again
ga: Má chloíonn tú le téarmaí an DSA, urscaoilfear an chuid eile de d’fhiachas leis na creidiúnaithe a chlúdaigh sé agus beidh tú sócmhainneach an athuair

source: The DSA has been designated as an insolvency proceeding which can benefit from cross-border recognition
ga: Tá an DSA ainmnithe mar imeacht dócmhainneachta ar féidir leis leas a bhaint as aitheantas trasteorann

source: This means that a debtor availing of a DSA will gain the same protection against creditors in most other EU countries that they receive in Ireland, subject to and in accordance with the Regulation on Insolvency Proceedings (EC) No 1346/2000 (pdf), as updated by Regulation (EU) No.663/2014 (pdf)
ga: Fágann sé sin go mbeidh an chosaint chéanna ar chreidiúnaithe i bhformhór na dtíortha eile den AE is atá aige/aici in Éirinn ag féichiúnaí atá ag baint leas as DSA, faoi réir agus de réir an Rialacháin (CE) Uimh. 1346/2000 maidir le hImeachtaí Dócmhainneachta (pdf), arna nuashonrú ag Rialachán (AE) Uimh. 663/2014 (pdf)

source: Read more in this press release
ga: Léigh tuilleadh sa phreaseisiúint seo

source: Mandatory terms of a DSA
ga: Téarmaí éigeantacha de DSA

source: There are certain elements that the DSA must contain:
ga: Is ann do ghnéithe áirithe nach mór a bheith sa DSA:

source: • The maximum duration of the agreement must be 5 years but this may be extended by up to one year in circumstances as specified in the terms of the arrangement
ga: • Ní mór gurb é 5 bliana uasfhad an chomhaontaithe ach féadfar é sin a shíneadh le bliain amháin ar a mhéad i gcásanna a shonraítear i dtéarmaí an chomhaontaithe

source: • If you keep to the terms of the agreement your remaining debts to the creditors covered by the DSA will be discharged
ga: • Má chloíonn tú le téarmaí do chomhaontaithe, urscaoilfear na fiacha fágtha leis na creidiúnaithe a chlúdaigh sé

source: • You remain liable for certain debts unless the proposed arrangement explicitly provides for a compromise agreement and the creditor has agreed in writing to accept this – see ‘Excluded debts’ and ‘Excludable debts’ above
ga: • Beidh tú faoi dhliteanas as fiacha áirithe mura ndéantar foráil shoiléir sa chomhaontú molta do chomhaontú comhréitigh agus gur chomhaontaigh an creidiúnaí i scríbhinn le glacadh leis - féach ‘fiacha eisiata’ agus ‘fiacha in-eisiata’ thuas

source: • The DSA cannot release you from fines or other monetary penalties arising from criminal offences
ga: • Ní féidir leis an DSA tú a scaoileadh ó fhíneálacha ná ó aon phionóis airgeadaíochta eile a thagann as cionta coiriúla

source: • It cannot require you to sell any assets that are reasonably necessary for your employment or business unless you agree to such a sale
ga: • Ní féidir leis éileamh ort aon sócmhainní atá riachtanach go réasúnach le haghaidh d’fhostaíochta nó do ghnó a dhíol mura gcomhaontaíonn tú leis an díol sin

source: • You must be left with enough income to maintain a reasonable standard of living for yourself and your dependants
ga: • Is gá go bhfuil go leor ioncaim fágtha agat chun caighdeán réasúnach maireachtála a choinneáil duit féin agus do do chleithiúnaithe

source: • It must not require you to dispose of your principal private residence (your home) or to cease to occupy it unless specific conditions are met
ga: • Is gá nach n-éilíonn sé ort do phríomhtheach cónaithe (do theach) a dhiúscairt ná scor de chónaí ann mura gcomhlíontar coinníollacha ar leith

source: • It must outline how your debts will be treated in the event of your death or mental incapacity
ga: • Is gá go leagann sé amach conas a dhéileálfar le d’fhiacha i gcás do bháis nó d’éagumais mheabhrach

source: • It must provide that your circumstances be reviewed by the Personal Insolvency Practitioner at regular intervals (not more than 12 months) during the currency of the DSA; this review will involve the preparation of a new Prescribed Financial Statement that must be sent to all the creditors
ga: • Is gá go ndéanann sé foráil go ndéanfaidh an Cleachtóir um Dhócmhainneacht Phearsanta athbhreithniú ar do chúinsí go tráthrialta (nach mó ná 12 mhí) le linn thréimhse feidhme an DSA; is éard a bheidh i gceist san athbhreithniú seo ná ullmhú a dhéanamh ar Ráiteas Airgeadais Forordaithe nua nach mór a sheoladh chuig na creidiúnaithe go léir

source: • It must make provision for the Personal Insolvency Practitioner’s costs
ga: • Is gá go ndéanann sé foráil do chostais an Chleachtóra um Dhócmhainneacht Phearsanta

source: If you are entitled to receive pension income or a pension lump sum, it will be treated as an income/asset for the purposes of a Debt Settlement Arrangement
ga: Má tá tú i dteideal ioncam pinsin nó cnapshuim phinsin a fháil, déileálfar leis/léi mar ioncam/shócmhainn chun críche an tSocraithe Réitigh Fiachais

source: The terms of the DSA may provide for some or all of that pension lump sum or income to be paid to your creditors while the DSA is in effect
ga: Féadfaidh téarmaí an DSA foráil a dhéanamh go n-íocfar an chnapshuim phinsin nó an t-ioncam pinsin ar fad, nó cuid di/de, le do chreidiúnaithe le linn don DSA bheith in éifeacht

source: Your pension fund itself will be excluded from any DSA arrangement if it is a relevant pension arrangement for the purposes of the Act
ga: Eiseofar do chiste pinsean féin ó aon socrú DSA más “socrú ábhartha pinsin” é chun críche an Achta

source: Approved Retirement Funds (ARFs) are not relevant pension arrangements and may be included in a DSA
ga: Ní “socruithe ábhartha pinsin” iad Cistí Scoir Formheasta (ARFanna) agus féadfar iad a chur san áireamh i socrú DSA

source: You must be transparent in relation to all pension contributions that you have made in the past
ga: Ní mór duit bheith follasach i leith gach ranníocaíochta pinsin a rinne tú roimhe seo

source: The PIP will review these and where the PIP or a creditor considers that you have made excessive pension contributions within 3 years prior to application for a protective certificate, either of them can apply to the court to recover these contributions for distribution to creditors
ga: Déanfaidh an PIP athbhreithniú orthu sin agus, sa chás go measann an PIP nó creidiúnaí go ndearna tú ranníocaíochtaí iomarcacha pinsin laistigh de 3 bliana sula ndearnadh iarratas ar dheimhniú cosanta, féadfaidh duine amháin díobh iarratas a dhéanamh chuig an gcúirt ar na ranníocaíochtaí sin a aisghabháil lena ndáileadh ar chreidiúnaithe

source: While the DSA is in effect, you may not get credit for any amount over €650 without informing the lender that you have a DSA
ga: Le linn don DSA bheith in éifeacht, ní fhéadfaidh tú creidmheas a fháil le haghaidh aon mhéid níos mó ná €650 gan eolas a thabhairt don iasachtóir go bhfuil DSA agat

source: You may not sell or deal in property above a certain value, except in accordance with the terms of the DSA
ga: Ní fhéadfaidh tú réadmhaoin os cionn luach áirithe a dhíol ná déileáil léi, seachas de réir théarmaí an DSA

source: However, no such restriction is placed on your spouse or civil partner
ga: Mar sin féin, ní chuirtear aon srianadh den chineál sin ar do chéile ná ar do pháirtnéir sibhialta

source: You must make your proposal for a DSA through a Personal Insolvency Practitioner (PIP)
ga: Ní mór duit do thogra le haghaidh DSA a dhéanamh trí Chleachtóir um Dhócmhainneacht Phearsanta (PIP)

source: This is a professional who is authorised by the Insolvency Service of Ireland (ISI) and will act on your behalf throughout the Debt Settlement Arrangement
ga: Is gairmí é sin atá údaraithe ag Seirbhís Dócmhainneachta na hÉireann (ISI) agus a ghníomhóidh thar do cheann ar fud an tSocraithe Réitigh Fiachais

source: The ISI has developed a standard protocol for use by PIPs when making straightforward proposals to creditors for a DSA
ga: D’fhorbair an ISI prótacal caighdeánach lena úsáid ag PIPanna agus tograí furasta á ndéanamh acu do chreidiúnaithe le haghaidh DSA

source: You must disclose all details of your financial affairs to the PIP, who will then advise you whether or not you meet the conditions for a DSA, what the consequences will be and what fees you may have to pay
ga: Ní mór duit gach sonra faoi do chúrsaí airgeadais a nochtadh don PIP, a chuirfidh comhairle ort ina dhiaidh sin maidir le cé acu a chomhlíonann tú nó nach gcomhlíonann tú na coinníollacha le haghaidh DSA, maidir leis na hiarmhairtí a bheidh air agus maidir leis na táillí a d’fhéadfadh a bheith ort a íoc

source: The PIP will also advise you of any other options that are available
ga: Chomh maith leis sin, cuirfidh an PIP comhairle ort maidir le haon roghanna eile atá ar fáil

source: The PIP will help you complete a Prescribed Financial Statement as part of your application, giving full and honest information about your financial circumstances
ga: Cabhróidh an PIP leat Ráiteas Airgeadais Forordaithe a chur i gcrích mar chuid de d’iarratas agus tabharfaidh sé/sí faisnéis iomlán ionraic agat faoi do chúinsí airgeadais

source: You must also make a declaration that you have been unable to agree an alternative repayment arrangement with your creditor(s)
ga: Caithfidh tú freisin dearbhú a dhéanamh nach raibh tú ábalta socrú malartach aisíocaíochta a chomhaontú le do chreidiúnaí/chreidiúnaithe

source: You will have to give your written consent to enable:
ga: Caithfidh tú do thoiliú i scríbhinn a thabhairt chun:

source: • The PIP to disclose your personal data to the ISI
ga: • Cur ar chumas an PIP do shonraí pearsanta a nochtadh don ISI

source: • The ISI to process your application
ga: • Cur ar chumas an ISI d’iarratas a phróiseáil

source: • The ISI to make any necessary enquiries about you and
ga: • Cur ar chumas an ISI aon fhiosruithe riachtanacha fút a dhéanamh agus

source: • The ISI to disclose your personal data to the creditors concerned, as required
ga: • Cur ar chumas an ISI do shonraí pearsanta a nochtadh do na creidiúnaithe lena mbaineann, de réir mar is gá
